FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC17xx_40xx/LPC17xx_40xx_USBHost.c
    // Setup memory from start
    p->iAllocBase = G_usbHostMemory;
    p->iAllocRemaining = sizeof(G_usbHostMemory);

    // Ensure power to the USB is on
    LPC17xx_40xxPowerOn(1UL<<31);

    // Enable the USB interrupt source
    if (p->iPortIndex == USB_HOST_PORT_INDEX_PORT_A) {
        LPC_USB->OTGClkCtrl = 0x0000001B;

        while ((LPC_USB->OTGClkSt & 0x0000001B) != 0x1B) {
            ;
        }

        LPC_USB->OTGStCtrl = 0x00000003;
    } else if (p->iPortIndex == USB_HOST_PORT_INDEX_PORT_B) {
        LPC_USB->OTGClkCtrl = 0x00000001;

        while ((LPC_USB->OTGClkSt & 0x00000001) == 0) {
            ;
        }
    }

    // Allocate standard buffers
    Hcca       = IAllocBuffer(p, sizeof(HCCA));
    TDHead     = IAllocBuffer(p, sizeof(HCTD));
    TDTail     = IAllocBuffer(p, sizeof(HCTD));
    EDCtrl     = IAllocBuffer(p, sizeof(HCED));
    EDBulkIn   = IAllocBuffer(p, sizeof(HCED));
    EDBulkOut  = IAllocBuffer(p, sizeof(HCED));
    TDBuffer   = IAllocBuffer(p, 128);

    // And then initialize those buffers
    IHost_EDInit(EDCtrl);
    IHost_EDInit(EDBulkIn);
    IHost_EDInit(EDBulkOut);
    IHost_TDInit(TDHead);
    IHost_TDInit(TDTail);
    IHost_HCCAInit(Hcca);

    // About to reset, first delay
    Host_DelayMS(50);
    LPC_USB->HcControl       = 0;
    LPC_USB->HcControlHeadED = 0;
    LPC_USB->HcBulkHeadED    = 0;

    // Now do the software reset and go back to the largest packet size
    LPC_USB->HcCommandStatus = OR_CMD_STATUS_HCR;
    LPC_USB->HcFmInterval    = DEFAULT_FMINTERVAL;

    // Put HC in operational state and set global power
    LPC_USB->HcControl  = (LPC_USB->HcControl & (~OR_CONTROL_HCFS)) | OR_CONTROL_HC_OPER;
    LPC_USB->HcRhStatus = OR_RH_STATUS_LPSC;
    LPC_USB->HcHCCA = (TUInt32)Hcca;

    // Remember the workspace for the interrupt routine
    // This also indirectly flags the interrupt routine by letting
    // the system know that we can now process interrupts.
    if (p->iPortIndex == USB_HOST_PORT_INDEX_PORT_A) {
        G_usbHostWorkspacePortA = p;
    } else {
        G_usbHostWorkspacePortB = p;
    }

    // Enable these interrupts
    LPC_USB->HcInterruptStatus |= LPC_USB->HcInterruptStatus;
    LPC_USB->HcInterruptEnable  = OR_INTR_ENABLE_MIE |
                         OR_INTR_ENABLE_WDH |
                         OR_INTR_ENABLE_RHSC;

    p->iState = USB_HOST_STATE_CLEAR;

    USBSharedInterruptSetup();

    // Remember the reset condition
    p->iResetAllocBase = p->iAllocBase;
    p->iResetAllocRemaining = p->iAllocRemaining;


    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  Host_ResetBuffers
 *---------------------------------------------------------------------------*
 * Description:
 *      Put the buffers back into a reset state
 * Inputs:
 *      void *aWorkspace            -- USB Host controller workspace
 *---------------------------------------------------------------------------*/
static void Host_ResetBuffers(void *aWorkspace)
{
    T_LPC17xx_40xx_USBHost_Workspace *p = (T_LPC17xx_40xx_USBHost_Workspace *)aWorkspace;

    p->iAllocBase = p->iResetAllocBase;
    p->iAllocRemaining = p->iResetAllocRemaining;
}

/*---------------------------------------------------------------------------*
 * Routine:  Host_ProcessTD
 *---------------------------------------------------------------------------*
 * Description:
 *      Process a single transfer descriptor
 * Inputs:
 *      void *aWorkspace            -- USB Host controller workspace
 *      volatile HCED *aEndDesc     -- Endpoint descriptor that contains this
 *                                      transfer descriptor.
 *      TUInt32 aToken              -- SETUP, IN, or OUT
 *      volatile TUInt8 *buffer     -- Current buffer pointer of the
 *                                      transfer descriptor.
 *      TUInt32 buffer_len          -- Length of the buffer.
 * Outputs:
 *      T_uezError                  -- UEZ_ERROR_NONE if successful, else
 *                                      error code.
 *---------------------------------------------------------------------------*/
static T_uezError Host_ProcessTD(
        void *aWorkspace,
        volatile HCED *aEndDesc,
        TUInt32 aToken,
        volatile TUInt8 *buffer,
        TUInt32 buffer_len,
        TUInt32 aTimeout)
{
    volatile TUInt32 td_toggle;
    T_LPC17xx_40xx_USBHost_Workspace *p = (T_LPC17xx_40xx_USBHost_Workspace *)aWorkspace;

    PARAM_NOT_USED(aTimeout);

    if (aEndDesc == EDCtrl) {
        if (aToken == TD_SETUP) {
            td_toggle = TD_TOGGLE_0;
        } else {
            td_toggle = TD_TOGGLE_1;
        }
    } else {
        td_toggle = 0;
    }

    // Setup a head and tail.  The tail points to nothing.
    // The head points ot the descriptor being sent.
    TDHead->Control = (TD_ROUNDING    |
                      aToken          |
                      TD_DELAY_INT(0) |
                      td_toggle       |
                      TD_CC);
    TDTail->Control = 0;
    TDHead->CurrBufPtr = (TUInt32) buffer;
    TDTail->CurrBufPtr = 0;
    TDHead->Next = (TUInt32) TDTail;
    TDTail->Next = 0;
    TDHead->BufEnd = (TUInt32)(buffer + (buffer_len - 1));
    TDTail->BufEnd = 0;

    // Setup the endpoint descriptor
    aEndDesc->HeadTd  = (TUInt32)TDHead | ((aEndDesc->HeadTd) & 0x00000002);
    aEndDesc->TailTd  = (TUInt32)TDTail;
    aEndDesc->Next    = 0;

    // Are we a control endpoint or a bulk endpoint?
    if (aEndDesc == EDCtrl) {
        // If control, setup for control transfer
        LPC_USB->HcControlHeadED = (TUInt32)aEndDesc;
        LPC_USB->HcCommandStatus = LPC_USB->HcCommandStatus | OR_CMD_STATUS_CLF;
        LPC_USB->HcControl       = LPC_USB->HcControl       | OR_CONTROL_CLE;
    } else {
        // Otherwise, setup for bulk transfer
        LPC_USB->HcBulkHeadED    = (TUInt32)aEndDesc;
        LPC_USB->HcCommandStatus = LPC_USB->HcCommandStatus | OR_CMD_STATUS_BLF;
        LPC_USB->HcControl       = LPC_USB->HcControl       | OR_CONTROL_BLE;
    }

    // Wait for transfer to complete
    if (p->iCallbackAPI->WaitForIRQEvent(p->iCallbackWorkspace, aTimeout)
        == UEZ_ERROR_TIMEOUT)
        return UEZ_ERROR_TIMEOUT;

    // Check if we had a failure.
    if (!(TDHead->Control & 0xF0000000)) {
        return (UEZ_ERROR_NONE);
    } else if (TDHead->Control & 0x40000000) {
        return (UEZ_ERROR_STALL);
    } else {
        // We're currently not returning error codes, just return
        // an unknown code.
        return (UEZ_ERROR_UNKNOWN);
    }
}

/*---------------------------------------------------------------------------*
 * Routine:  Host_CtrlSend
 *---------------------------------------------------------------------------*
 * Description:
 *      Send control information.  Data in the common transfer descriptor
 *      is sent (if aLength > 0).
 * Inputs:
 *      void *aWorkspace            -- USB Host controller workspace
 *      TUInt8 aBMRequestType       -- Type of request
 *      TUInt8 aRequest             -- Request
 *      TUInt16 aValue              -- Value for request
 *      TUInt16 aIndex              -- Index for request
 *      TUInt16 aLength             -- Length of data in command
 *                                      (currently in TDBuffer)
 * Outputs:
 *      T_uezError                  -- UEZ_ERROR_NONE if successful, else
 *                                      error code.
 *---------------------------------------------------------------------------*/
static T_uezError  Host_CtrlSend(
            void *aWorkspace,
            void *aBuffer,
            TUInt8 aDeviceAddress,
            TUInt8 aBMRequestType,
            TUInt8 aRequest,
            TUInt16 aValue,
            TUInt16 aIndex,
            TUInt16 aLength,
            TUInt32 aTimeout)
{
    T_uezError error;
    T_LPC17xx_40xx_USBHost_Workspace *p = (T_LPC17xx_40xx_USBHost_Workspace *)aWorkspace;

    IHost_FillSetup(p, aBMRequestType, aRequest, aValue, aIndex, aLength);
    error = Host_ProcessTD(aWorkspace, EDCtrl, TD_SETUP, TDBuffer, 8, aTimeout);
    if (error == UEZ_ERROR_NONE) {
        if (aLength)
            error = Host_ProcessTD(aWorkspace, EDCtrl, TD_OUT, aBuffer, aLength, aTimeout);
        if (error == UEZ_ERROR_NONE)
            error = Host_ProcessTD(aWorkspace, EDCtrl, TD_IN, 0, 0, aTimeout);
    }
    return (error);
}

T_uezError Host_SetAddress(void *aWorkspace, TUInt8 aAddress)
{
    T_uezError error;

    error = Host_CtrlSend(
            aWorkspace,
            0,
            0,
            USB_HOST_TO_DEVICE | USB_RECIPIENT_DEVICE,
            SET_ADDRESS,
            aAddress,
            0,
            0,
            TIMEOUT_STANDARD);

